{
    "year": 2016,
    "day": 11,
    "part1": {
        "description": "",
        "answer": "37",
        "converted_description": "You are given a description of an isolated containment area with four floors. Each floor contains various types of generators and microchips. The goal is to bring all of the objects to the fourth floor using an elevator. However, there are certain rules and limitations that must be followed:\n\n1. The elevator can carry at most two objects (either generators or microchips) in any combination, including yourself.\n2. The elevator only functions if it contains at least one object (generator or microchip).\n3. The objects in the elevator and the objects on the same floor can irradiate each other while the elevator is recharging.\n4. Microchips left in the same area as a generator, without being connected to their own generator, will be destroyed.\n\nFor example, suppose the isolated area has the following arrangement:\n\nThe first floor contains a hydrogen-compatible microchip and a lithium-compatible microchip.\nThe second floor contains a hydrogen generator.\nThe third floor contains a lithium generator.\n\nThe fourth floor contains nothing relevant.\n\nAs a diagram (F# for a Floor number, E for Elevator, H for Hydrogen, L for Lithium, M for Microchip, and G for Generator), the initial state looks like this:\n\nF4 .  .  .  .  .  \nF3 .  .  .  LG .  \nF2 .  HG .  .  .  \nF1 E  .  HM .  LM \nYour task is to find the minimum number of steps required to bring all of the objects to the fourth floor for assembly.\n\nInput Format:\nThe input consists of a description of the isolated containment area. Each line represents a floor and contains a list of objects separated by commas. The objects can be generators or microchips, and they are represented by their element name."
    },
    "part2": {
        "description": "",
        "answer": "61",
        "converted_description": "You are given a description of an isolated containment area with four floors. Each floor contains various types of generators and microchips. The goal is to bring all of the objects to the fourth floor using an elevator. However, there are certain rules and limitations that must be followed:\n\n1. The elevator can carry at most two objects (either generators or microchips) in any combination, including yourself.\n2. The elevator only functions if it contains at least one object (generator or microchip).\n3. The objects in the elevator and the objects on the same floor can irradiate each other while the elevator is recharging.\n4. Microchips left in the same area as a generator, without being connected to their own generator, will be destroyed.\n\nIn addition to the initial objects, there are four new objects on the first floor: an elerium generator, an elerium-compatible microchip, a dilithium generator, and a dilithium-compatible microchip.\n\nYour task is to find the minimum number of steps required to bring all of the objects, including these four new ones, to the fourth floor for assembly.\n\nInput Format:\nThe input consists of a description of the isolated containment area. Each line represents a floor and contains a list of objects separated by commas. The objects can be generators or microchips, and they are represented by their element name."
    },
    "input": "The first floor contains a strontium generator, a strontium-compatible microchip, a plutonium generator, and a plutonium-compatible microchip.\nThe second floor contains a thulium generator, a ruthenium generator, a ruthenium-compatible microchip, a curium generator, and a curium-compatible microchip.\nThe third floor contains a thulium-compatible microchip.\nThe fourth floor contains nothing relevant."
}