{
    "year": 2018,
    "day": 15,
    "part1": {
        "description": "",
        "answer": "201638",
        "converted_description": "You are given a map of an area, which includes walls (#), open caverns (.), and the starting positions of Goblins (G) and Elves (E). Combat proceeds in rounds, with each unit taking a turn. On each unit's turn, it tries to move into range of an enemy and then attack if in range. Units never move or attack diagonally and ties are broken in reading order. Each unit begins its turn by identifying all possible targets and then identifies all open squares in range of each target. If the unit is already in range of a target, it attacks; otherwise, it tries to move. To move, the unit considers the squares in range and determines which square it could reach in the fewest steps. If no squares in range are reachable, the unit ends its turn. If multiple squares are reachable and tied for being reachable in the fewest steps, the square first in reading order is chosen. After moving or if already in range, the unit attacks. To attack, the unit determines all targets in range and selects the adjacent target with the fewest hit points, breaking ties in reading order. The unit deals damage equal to its attack power to the selected target, reducing its hit points. If a target's hit points reach 0 or below, it dies and is removed from the map. Each unit, Goblin or Elf, has 3 attack power and starts with 200 hit points. The outcome of the battle is the number of full rounds completed multiplied by the sum of the hit points of all remaining units at the moment combat ends. What is the outcome of the combat?\n\nInput Format:\nThe input consists of a map of the area, represented by characters: # for walls, . for open caverns, G for Goblins, and E for Elves."
    },
    "part2": {
        "description": "",
        "answer": "95764",
        "converted_description": "Find the outcome of the battle in which the Elves have the lowest integer attack power (at least 4) that allows them to win without a single death. The Goblins always have an attack power of 3. What is the outcome of the combat?\n\nInput Format:\nThe input consists of a map of the area, represented by characters: # for walls, . for open caverns, G for Goblins, and E for Elves."
    },
    "input": "################################\n#####################...########\n###################....G########\n###################....#########\n#######.##########......########\n#######G#########........#######\n#######G#######.G.........######\n#######.######..G.........######\n#######.......##.G...G.G..######\n########..##..#....G......G#####\n############...#.....G.....#####\n#...#######..........G.#...#####\n#...#######...#####G......######\n##...######..#######G.....#.##.#\n###.G.#####.#########G.........#\n###G..#####.#########.......#.E#\n###..######.#########..........#\n###.......#.#########.....E..E.#\n#####G...#..#########.......#..#\n####.G.#.#...#######.....G.....#\n########......#####...........##\n###########..................###\n##########.................#####\n##########.................#####\n############..E.........E.....##\n############.........E........##\n###############.#............E##\n##################...E..E..##.##\n####################.#E..####.##\n################.....######...##\n#################.#..###########\n################################"
}