{
    "year": 2018,
    "day": 7,
    "part1": {
        "description": "",
        "answer": "GKRVWBESYAMZDPTIUCFXQJLHNO",
        "converted_description": "You are given a set of instructions that specify a series of steps and their dependencies. Each step is represented by a single letter. Your task is to determine the order in which the steps should be completed. If multiple steps are ready, choose the step that is first alphabetically. Return the correct order of steps.\n\nInput Format:\nThe input is a set of instructions in the format \"Step X must be finished before step Y can begin.\" Each instruction is on a separate line."
    },
    "part2": {
        "description": "",
        "answer": "903",
        "converted_description": "You are given the same set of instructions as in Part 1. However, this time you have multiple workers who can work on steps simultaneously. Each step takes 60 seconds plus an amount corresponding to its letter (A=1, B=2, C=3, and so on). Steps can be worked on in alphabetical order. Return the time it takes for all steps to be completed with the given number of workers.\n\nInput Format:\nThe input is a set of instructions in the format \"Step X must be finished before step Y can begin.\" Each instruction is on a separate line."
    },
    "input": "Step W must be finished before step B can begin.\nStep G must be finished before step T can begin.\nStep B must be finished before step P can begin.\nStep R must be finished before step M can begin.\nStep K must be finished before step Q can begin.\nStep Z must be finished before step X can begin.\nStep V must be finished before step S can begin.\nStep D must be finished before step U can begin.\nStep Y must be finished before step J can begin.\nStep A must be finished before step C can begin.\nStep M must be finished before step U can begin.\nStep E must be finished before step X can begin.\nStep T must be finished before step F can begin.\nStep U must be finished before step C can begin.\nStep C must be finished before step Q can begin.\nStep S must be finished before step N can begin.\nStep X must be finished before step H can begin.\nStep F must be finished before step L can begin.\nStep Q must be finished before step J can begin.\nStep P must be finished before step J can begin.\nStep I must be finished before step L can begin.\nStep J must be finished before step L can begin.\nStep L must be finished before step N can begin.\nStep H must be finished before step O can begin.\nStep N must be finished before step O can begin.\nStep B must be finished before step S can begin.\nStep A must be finished before step T can begin.\nStep G must be finished before step K can begin.\nStep Z must be finished before step N can begin.\nStep V must be finished before step I can begin.\nStep Z must be finished before step Q can begin.\nStep I must be finished before step J can begin.\nStep S must be finished before step I can begin.\nStep P must be finished before step I can begin.\nStep B must be finished before step C can begin.\nStep M must be finished before step L can begin.\nStep G must be finished before step Z can begin.\nStep M must be finished before step C can begin.\nStep U must be finished before step F can begin.\nStep B must be finished before step Y can begin.\nStep W must be finished before step U can begin.\nStep G must be finished before step M can begin.\nStep M must be finished before step J can begin.\nStep C must be finished before step L can begin.\nStep K must be finished before step D can begin.\nStep S must be finished before step X can begin.\nStep Q must be finished before step N can begin.\nStep V must be finished before step N can begin.\nStep R must be finished before step C can begin.\nStep E must be finished before step H can begin.\nStep D must be finished before step P can begin.\nStep H must be finished before step N can begin.\nStep X must be finished before step O can begin.\nStep K must be finished before step Y can begin.\nStep R must be finished before step F can begin.\nStep L must be finished before step O can begin.\nStep Y must be finished before step M can begin.\nStep T must be finished before step I can begin.\nStep T must be finished before step Q can begin.\nStep B must be finished before step F can begin.\nStep C must be finished before step N can begin.\nStep V must be finished before step M can begin.\nStep T must be finished before step N can begin.\nStep S must be finished before step L can begin.\nStep P must be finished before step H can begin.\nStep X must be finished before step Q can begin.\nStep Z must be finished before step I can begin.\nStep Q must be finished before step O can begin.\nStep I must be finished before step N can begin.\nStep E must be finished before step P can begin.\nStep R must be finished before step L can begin.\nStep P must be finished before step L can begin.\nStep T must be finished before step H can begin.\nStep G must be finished before step X can begin.\nStep J must be finished before step H can begin.\nStep G must be finished before step V can begin.\nStep K must be finished before step N can begin.\nStep R must be finished before step Q can begin.\nStep Z must be finished before step T can begin.\nStep E must be finished before step F can begin.\nStep Y must be finished before step H can begin.\nStep P must be finished before step N can begin.\nStep S must be finished before step O can begin.\nStep L must be finished before step H can begin.\nStep W must be finished before step E can begin.\nStep X must be finished before step N can begin.\nStep Z must be finished before step D can begin.\nStep A must be finished before step H can begin.\nStep T must be finished before step X can begin.\nStep E must be finished before step Q can begin.\nStep K must be finished before step U can begin.\nStep M must be finished before step T can begin.\nStep J must be finished before step O can begin.\nStep D must be finished before step N can begin.\nStep K must be finished before step A can begin.\nStep G must be finished before step E can begin.\nStep R must be finished before step H can begin.\nStep W must be finished before step M can begin.\nStep U must be finished before step N can begin.\nStep Q must be finished before step H can begin.\nStep Y must be finished before step A can begin."
}