{
    "year": 2018,
    "day": 24,
    "part1": {
        "description": "",
        "answer": "14377",
        "converted_description": "You are given two armies: the Immune System and the Infection. Each army consists of multiple groups, and each group has hit points, attack damage, attack type, initiative, and possibly weaknesses or immunities. The groups fight until only one army remains. During each round of combat, groups select targets and deal damage based on their attack type and the defending group's weaknesses and immunities. The fight ends when one army has no remaining groups. Determine how many units the winning army has.\n\nInput Format:\nThe input consists of two sections separated by an empty line. The first section describes the Immune System army, and the second section describes the Infection army. Each army is represented by a list of groups, where each group is described by its number of units, hit points, attack damage, attack type, initiative, and any weaknesses or immunities."
    },
    "part2": {
        "description": "",
        "answer": "6947",
        "converted_description": "You need to find the smallest boost that would allow the immune system to win the fight against the infection. A boost is an integer increase in the immune system units' attack damage. Determine how many units the immune system has left after getting the smallest boost it needs to win.\n\nInput Format:\nThe input consists of two sections separated by an empty line. The first section describes the Immune System army, and the second section describes the Infection army. Each army is represented by a list of groups, where each group is described by its number of units, hit points, attack damage, attack type, initiative, and any weaknesses or immunities. The format `Immune System/Infection:\n<unit value> units each with <hitpoint value> hit points(<weaknesses/immunities>) with an attack that does <damage value> <attack type> damage at initiative <initiative value>`."
    },
    "input": "Immune System:\n916 units each with 3041 hit points (weak to cold, fire) with an attack that does 29 fire damage at initiative 13\n1959 units each with 7875 hit points (weak to cold; immune to slashing, bludgeoning) with an attack that does 38 radiation damage at initiative 20\n8933 units each with 5687 hit points with an attack that does 6 slashing damage at initiative 15\n938 units each with 8548 hit points with an attack that does 89 radiation damage at initiative 4\n1945 units each with 3360 hit points (immune to cold; weak to radiation) with an attack that does 16 cold damage at initiative 1\n2211 units each with 7794 hit points (weak to slashing) with an attack that does 30 fire damage at initiative 12\n24 units each with 3693 hit points with an attack that does 1502 fire damage at initiative 5\n2004 units each with 4141 hit points (immune to radiation) with an attack that does 18 slashing damage at initiative 19\n3862 units each with 3735 hit points (immune to bludgeoning, fire) with an attack that does 9 fire damage at initiative 10\n8831 units each with 3762 hit points (weak to radiation) with an attack that does 3 fire damage at initiative 7\n\nInfection:\n578 units each with 55836 hit points with an attack that does 154 radiation damage at initiative 9\n476 units each with 55907 hit points (weak to fire) with an attack that does 208 cold damage at initiative 18\n496 units each with 33203 hit points (weak to fire, radiation; immune to cold, bludgeoning) with an attack that does 116 slashing damage at initiative 14\n683 units each with 12889 hit points (weak to fire) with an attack that does 35 bludgeoning damage at initiative 11\n1093 units each with 29789 hit points (immune to cold, fire) with an attack that does 51 radiation damage at initiative 17\n2448 units each with 40566 hit points (immune to bludgeoning, fire; weak to cold) with an attack that does 25 slashing damage at initiative 16\n1229 units each with 6831 hit points (weak to fire, cold; immune to slashing) with an attack that does 8 bludgeoning damage at initiative 8\n3680 units each with 34240 hit points (immune to bludgeoning; weak to fire, cold) with an attack that does 17 radiation damage at initiative 3\n4523 units each with 9788 hit points (immune to bludgeoning, fire, slashing) with an attack that does 3 bludgeoning damage at initiative 6\n587 units each with 49714 hit points (weak to bludgeoning) with an attack that does 161 fire damage at initiative 2"
}