{
    "year": 2017,
    "day": 15,
    "part1": {
        "description": "",
        "answer": "650",
        "converted_description": "You are given two generators, Generator A and Generator B, which generate sequences of numbers based on a starting value and a factor. The generators produce their next value by taking the previous value, multiplying it by the factor, and then keeping the remainder of dividing that product by 2147483647. The judge compares the lowest 16 bits of the values generated by both generators and counts the number of times those parts match.\n\nTo calculate each generator's first value, it uses a specific starting value as its \"previous value\". The judge wants to consider 40 million pairs of generated values and count the total number of pairs that match in their lowest 16 bits.\n\nWhat is the judge's final count after 40 million pairs?\n\nInput Format:\nThe input consists of two lines. The first line contains the starting value for Generator A. The second line contains the starting value for Generator B. E.g. `Generator A starts with 634\nGenerator B starts with 301`."
    },
    "part2": {
        "description": "",
        "answer": "336",
        "converted_description": "In this new version, the generators only provide a value to the judge if it meets their criteria. Generator A looks for values that are multiples of 4, while Generator B looks for values that are multiples of 8. The generators still generate values using the same method as before, but they only hand acceptable values to the judge.\n\nThe judge compares the lowest 16 bits of the values provided by both generators in the order they are received and counts the number of matching pairs. The judge is now only willing to consider 5 million pairs.\n\nAfter 5 million pairs, but using this new generator logic, what is the judge's final count?\n\nInput Format:\nThe input consists of two lines. The first line contains the starting value for Generator A. The second line contains the starting value for Generator B. E.g. `Generator A starts with 634\nGenerator B starts with 301`."
    },
    "input": "Generator A starts with 783\nGenerator B starts with 325"
}